#!/bin/bash
source ~/miniconda3/etc/profile.d/conda.sh

#Аннотация образцов
declare -A map
map[V350241697_L01_81]="A1_α"
map[V350241697_L02_81]="A1_β"
map[V350241697_L01_82]="B1_α"
map[V350241697_L02_82]="B1_β"
map[V350241697_L01_83]="C1_α"
map[V350241697_L02_83]="C1_β"
map[V350241697_L01_84]="D1_α"
map[V350241697_L01_85]="E1_α"
map[V350241697_L02_85]="E1_β"
map[V350241697_L01_86]="F1_α"
map[V350241697_L02_86]="F1_β"
map[V350241697_L01_87]="A2_α"
map[V350241697_L02_87]="A2_β"
map[V350241697_L01_88]="C2_α"
map[V350241697_L02_88]="C2_β"
map[V350241697_L01_89]="E2_α"
map[V350241697_L02_89]="E2_β"
map[V350241697_L01_90]="G1_α"
map[V350241697_L02_90]="G1_β"
map[V350241697_L01_91]="H1_α"
map[V350241697_L02_91]="H1_β"
map[V350241697_L01_92]="Ι1_α"
map[V350241697_L02_92]="Ι1_β"
map[V350241697_L01_93]="G2_α"
map[V350241697_L02_93]="G2_β"
map[V350241697_L01_94]="I2_α"
map[V350241697_L02_94]="I2_β"
map[V350241697_L01_96]="G3_α"
map[V350241697_L02_96]="G3_β"
map[V350241697_L01_126]="H2_α"
map[V350241697_L02_126]="H2_β"
map[V350241697_L01_127]="G4_α"
map[V350241697_L02_127]="G4_β"
map[V350241697_L01_128]="I3_α"
map[V350241697_L02_128]="I3_β"
map[V350241697_L03_81]="K1_α"
map[V350241697_L04_81]="K1_β"
map[V350241697_L03_82]="K2_α"
map[V350241697_L04_82]="K2_β"
map[V350241697_L03_84]="K4_α"
map[V350241697_L04_84]="K4_β"
map[V350241697_L03_85]="K5_α"
map[V350241697_L04_85]="K5_β"
map[V350241697_L03_87]="K7_α"
map[V350241697_L04_87]="K7_β"
map[V350241697_L03_88]="K8_α"
map[V350241697_L04_88]="K8_β"
map[V350241697_L03_89]="K9_α"
map[V350241697_L04_89]="K9_β"
map[V350241697_L03_90]="K10_α"
map[V350241697_L04_90]="K10_β"
map[V350241697_L03_91]="K11_α"
map[V350241697_L04_91]="K11_β"
map[V350241697_L03_128]="K12_α"
map[V350241697_L04_128]="K12_β"
map[V350241697_L03_92]="K13_α"
map[V350241697_L04_92]="K13_β"

for i in V350241697_L01_81 \
V350241697_L02_81 \
V350241697_L01_82 \
V350241697_L02_82 \
V350241697_L01_83 \
V350241697_L02_83 \
V350241697_L01_84 \
V350241697_L01_85 \
V350241697_L02_85 \
V350241697_L01_86 \
V350241697_L02_86 \
V350241697_L01_87 \
V350241697_L02_87 \
V350241697_L01_88 \
V350241697_L02_88 \
V350241697_L01_89 \
V350241697_L02_89 \
V350241697_L01_90 \
V350241697_L02_90 \
V350241697_L01_91 \
V350241697_L02_91 \
V350241697_L01_92 \
V350241697_L02_92 \
V350241697_L01_93 \
V350241697_L02_93 \
V350241697_L01_94 \
V350241697_L02_94 \
V350241697_L01_96 \
V350241697_L02_96 \
V350241697_L01_126 \
V350241697_L02_126 \
V350241697_L01_127 \
V350241697_L02_127 \
V350241697_L01_128 \
V350241697_L02_128 \
V350241697_L01_128 \ 
V350241697_L02_128 \
V350241697_L03_81 \
V350241697_L04_81 \
V350241697_L03_82 \
V350241697_L04_82 \
V350241697_L03_84 \
V350241697_L04_84 \
V350241697_L03_85 \
V350241697_L04_85 \
V350241697_L03_87 \
V350241697_L04_87 \
V350241697_L03_88 \
V350241697_L04_88 \
V350241697_L03_89 \
V350241697_L04_89 \
V350241697_L03_90 \
V350241697_L04_90 \
V350241697_L03_91 \
V350241697_L04_91 \
V350241697_L03_128 \
V350241697_L04_128 \
V350241697_L03_92 \
V350241697_L04_92 \

do

# Присвоение переменной значение согласно аннотации
    j=${map[$i]}

# Создание рабочей директории
    mkdir /sandbox/sikamov/TCR/results/${j} 
    cd /sandbox/sikamov/TCR/results/${j}

# Активация окружения с программой Cutadapt
    conda activate cutadaptenv

# Фильтрация прочтений при помощи Cutadapt
    cutadapt \
        -a AAGTCGGAGGCCAAGCGGTCTTAGGAAGACAA \
        -A AAGTCGGATCGTAGCCATGTCGTTCTGTGAGCCAAGGAGTTG \
        --max-n 0 -q 20 --minimum-length 100 \
        -o /sandbox/sikamov/TCR/data/${i}_1_trimm.fq.gz \
        -p /sandbox/sikamov/TCR/data/${i}_2_trimm.fq.gz \
        /sandbox/sikamov/TCR/data/${i}_1.fq.gz /sandbox/sikamov/TCR/data/${i}_2.fq.gz 

# Анализ качества прочтений при помощи программы FastQC
    fastqc /sandbox/sikamov/TCR/data/${i}_*.fq.gz /sandbox/sikamov/TCR/data/  

# Активация окружения с программой MiXCR
    conda activate TCRenv

# Анализ данных TCR секвенирования при помощи MiXCR
    mixcr -Xmx30g analyze generic-amplicon-with-umi \
        -f \
        --species hsa \
        --rna \
        --rigid-left-alignment-boundary \
        --floating-right-alignment-boundary C \
        --tag-pattern "^(R1:*)\^(UMI:N{14})CTTG{1:21}(R2:*)" \
        /sandbox/sikamov/TCR/data/${i}_1_trimm.fq.gz \
        /sandbox/sikamov/TCR/data/${i}_2_trimm.fq.gz \
        /sandbox/sikamov/TCR/results/${j}/${j} 
   cd ../

   done
